// Дано натуральное число N. Вывести на экран числа от 1 до N.
// Составляющие элементы цикла:
// 1.Повторяемое дейстивие
// 2.Вспомогательные переменные
// 3.Условия цикла

int n = 100;
int i = 1;

while (i <= n)
{
    //Console.WriteLine(i);
    Console.Write(i);
    Console.Write(' ');
    i = i + 1;
}
